# цвет (общий)
COLOR = {
    'Общий список': {
        'Beige': 'Бежевый',
        'White': 'Белый',
        'Turquoise': 'Бирюзовый',
        'Сyan': 'Голубой',
        'Green': 'Зеленый',
        'Golden': 'Золотой',
        'Brown': 'Коричневый',
        'Orange': 'Оранжевый',
        'Powdery': 'Пудровый',
        'Pink': 'Розовый',
        'Silver': 'Серебристый',
        'Gray': 'Серый',
        'Blue': 'Синий',
        'Lilac': 'Сиреневый',
        'Violet': 'Фиолетовый',
        'Black': 'Черный',
    }
}
# состав
COMPOSITION = {
    'Общий': {
        '100% cotton': '100% хлопок',
    }
}

# дизайн
DESIGN = {
    'Общий список': {
        'Classic': 'Классический',
        'Geometric': 'Геометрический',
        'Modern': 'Современный',
        'Floral': 'Цветочный',
        'Child': 'Детский',
        'Solid color': 'Однотонный',
        'Thematic': 'Тематический',
    }
}
# материал
MATERIAL = {
    'Общий список': {
        'Cotton': 'Xлопок',
        'Combed cotton': 'Чесаный хлопок',
        'Satin': 'Сатин',
        'Stripe satin': 'Страйп сатин',
        'Premium satin': 'Сатин премиум',
        'Jacquard': 'Жаккард',
        'Tensel': 'Тенсель',
        'Mahra': 'Махра',
        'Velour/mahra': ' Велюр/махра',
    }
}
# плотность
DENSITY = {
    'Общий список': {
        '200 TC': '200 TC',
        '300 TC': '300 TC',
        '400 TC': '400 TC',
    },
    'Полотенца': {
        '520 g/m2': '520 гр/м2',
        '500 g/m2': '500 гр/м2',
        '600 g/m2': '600 гр/м2',
        '610 g/m2': '610 гр/м2',
        '800 g/m2': '800 гр/м2',
    }
}
# режим стирки
WASHING_MODE = {
    'Общий список': {
        'washing at 40': 'Стирка при 40°С',
        'washing at 30': 'Стирка при 30°С',
    }
}
# вид простыни (комплекты и простыни)
TYPE_BED_SHEET = [
    ('bez-rezinki', 'Без резинки'),
    ('s-rezinkoy', 'На резинке'),
]
# наличие вышивки (полотенца)
TOWEL_PRESENCE_OF_EMBROIDERY = [
    ('with embroidery', 'с вышивкой'),
    ('without embroidery', 'без вышивки'),
]

# наполнитель (покрывала)
BEDSPREAD_FILLER = [
    ('100% microfiber', '100% микрофибра'),
]

# упаковка
SHIPPING_WEIGHT = [
    ('PVC Package', 'Пакет ПВХ'),
]

# # размер наволочки (общий)
# SIZE_PILLOWCASE = [
#     ('18x50 valik', '18x50 (валик)'),
#     ('30x40', '30x40'),
#     ('40x40', '40x40'),
#     ('50x70', '50x70'),
#     ('70x70', '70x70'),
# ]

# # размер простыни (общий)
# SIZE_BED_SHEET = [
#     ('200x220', '200x220'),
#     ('250x245', '250x245'),
# ]
# # размер простыни на резинке (общий)
# SIZE_BED_SHEET_ELASTIC = [
#     ('90x200x20', '90x200x20'),
#     ('140x200x20', '140x200x20'),
#     ('160x200x20', '160x200x20'),
#     ('180x200x20', '180x200x20'),
#     ('200x200x30', '200x200x30'),
#     ('180x200x30', '180x200x30'),
#     ('160x200x30', '160x200x30'),
#     ('140x200x30', '140x200x30'),
#     ('90x200x30', '90x200x30'),
#     ('80x200x30', '80x200x30'),
#     ('120x200x30', '120x200x30'),
# ]
# # размер пододеяльника (общий)
# SIZE_DUVET_COVER = [
#     ('150x210', '150x210'),
#     ('200x220', '200x220'),
# ]
# # размер постельного белья (общий)
# SIZE_BED_LINEN = [
#     ('Small-2', 'Полуторный (2 pcs)'),
#     ('Small-3', 'Полуторный (3 pcs)'),
#     ('Small-4', 'Полуторный (4 pcs)'),
#     ('Medium-6', 'Двуспальный Евро (6 pcs)'),
#     ('Medium-7', 'Двуспальный Евро (7 pcs)'),
#     ('Medium-8', 'Двуспальный Евро (8 pcs)'),
#     ('Large-7', 'Семейный Дуэт (7 pcs)'),
#     ('Large-8', 'Семейный Дуэт (8 pcs)'),
#     ('Large-9', 'Семейный Дуэт (9 pcs)'),
# ]

# # размер вафельных полотенец (полотенца)
# TOWEL_SIZE_OF_WAFFLE_TOWELS = [
#     ('90x160', '90x160'),
# ]
# # размер махровых полотенец (полотенца)
# TOWEL_SIZE_OF_TERRY_TOWELS = [
#     ('30x50', '30x50'),
#     ('48x90', '48x90'),
#     ('50x70', '50x70'),
#     ('50x100', '50x100'),
#     ('70x127', '70x127'),
#     ('70x140', '70x140'),
#     ('Set', 'Набор'),
#     ('50x70, 50x100, 70x140', '50x70, 50x100, 70x140'),
# ]
# # размер уголка (полотенца, детское)
# TOWEL_SIZE_CORNER = [
#     ('90x90', '90x90'),
# ]

# # размер покрывала
# BEDSPREAD_SIZE = [
#     ('240x240', '240x240'),
# ]





